trade/src/Documents/АктПримененияСАТУРН/АктПримененияСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПримененияСАТУРН</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПартийСАТУРН</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСАТУРН</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХраненияСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрименения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПримененияПАТ</name>
    <type>
      <types>EnumRef.СпособыПримененияПАТСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАкта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеАктПримененияСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоПриказу420</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипИзмеряемойВеличиныСАТУРН</name>
      <type>
        <types>EnumRef.ТипыИзмеряемыхВеличинСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВУпаковкеСАТУРН</name>
      <type>
        <types>DefinedType.КоличествоВУпаковкеСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>ПАТ</name>
      <type>
        <types>CatalogRef.КлассификаторПАТСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>Дозировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПрименения</name>
      <type>
        <types>CatalogRef.МестаПримененияСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнесеноНаПлощадь</name>
      <comment>Внесено на площадь, га</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МестаПрименения</name>
    <attributes>
      <name>ТипМестаПрименения</name>
      <type>
        <types>EnumRef.ТипыМестПримененияСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПрименения</name>
      <type>
        <types>CatalogRef.МестаПримененияСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеМестаПрименения</name>
      <type>
        <types>DefinedType.СтрокаСАТУРН</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade/src/AccumulationRegisters/ОстаткиПартийСАТУРН/ОстаткиПартийСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПартийСАТУРН</name>
  <resources>
    <name>КоличествоСАТУРН</name>
    <type>
      <types>DefinedType.КоличествоСАТУРН</types>
    </type>
  </resources>
  <resources>
    <name>ВОбработкеСАТУРН</name>
    <type>
      <types>DefinedType.КоличествоСАТУРН</types>
    </type>
  </resources>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииСАТУРН</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

trade/src/Enums/ТипыМестПримененияСАТУРН/ТипыМестПримененияСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыМестПримененияСАТУРН</name>
  <enumValues>
    <name>АвтомобилиАвтомобильныеПрицепы</name>
  </enumValues>
  <enumValues>
    <name>Вагоны</name>
  </enumValues>
  <enumValues>
    <name>ВоздушныйТранспорт</name>
  </enumValues>
  <enumValues>
    <name>ГрузовойОтсекТранспортногоСудна</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрованноеМестоПрименения</name>
  </enumValues>
  <enumValues>
    <name>Здание</name>
  </enumValues>
  <enumValues>
    <name>ЗемлиСельскохозяйственногоНазначения</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственныеПомещения</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеЗемельныеУчастки</name>
  </enumValues>
  <enumValues>
    <name>СкладскиеПомещения</name>
  </enumValues>
  <enumValues>
    <name>Суда</name>
  </enumValues>
  <enumValues>
    <name>Иное</name>
  </enumValues>
</mdclass:Enum>

trade/src/Documents/ПланПримененияСАТУРН/ПланПримененияСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланПримененияСАТУРН</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеПланПримененияСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСАТУРН</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаПрименения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПримененияПАТ</name>
    <type>
      <types>EnumRef.СпособыПримененияПАТСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОграничений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИзмеряемойВеличиныСАТУРН</name>
      <type>
        <types>EnumRef.ТипыИзмеряемыхВеличинСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВУпаковкеСАТУРН</name>
      <type>
        <types>DefinedType.КоличествоВУпаковкеСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПАТ</name>
      <type>
        <types>CatalogRef.КлассификаторПАТСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>Дозировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыходаРучныеРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыходаМеханизированныеРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МестаПрименения</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипМестаПрименения</name>
      <type>
        <types>EnumRef.ТипыМестПримененияСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПрименения</name>
      <type>
        <types>CatalogRef.МестаПримененияСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеМестаПрименения</name>
      <type>
        <types>DefinedType.СтрокаСАТУРН</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade/src/Documents/АктПримененияСАТУРН/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура")Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПланПримененияСАТУРН") Тогда
		
		ЗаполнитьПоПлануПримененияСАТУРН(ДанныеЗаполнения);
		
	КонецЕсли;
	
	ИнтеграцияСАТУРНПереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ЗаполнитьОбъектПоСтатистике();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Серия");
	МассивНепроверяемыхРеквизитов.Добавить("МестаПрименения.МестоПрименения");
	
	ШаблонСообщения = НСтр("ru = 'Не заполнено поле ""%1"" в строке %2 списка ""%3""'");
	Для Каждого СтрокаТаблицы Из МестаПрименения Цикл
		
		Если (СтрокаТаблицы.ТипМестаПрименения = Перечисления.ТипыМестПримененияСАТУРН.ЗарегистрованноеМестоПрименения
			Или Не ЗначениеЗаполнено(СтрокаТаблицы.ТипМестаПрименения))
			И Не ЗначениеЗаполнено(СтрокаТаблицы.МестоПрименения) Тогда
			ТекстСообщения = СтрШаблон(
				ШаблонСообщения,
				Метаданные.Документы.АктПримененияСАТУРН.ТабличныеЧасти.МестаПрименения.Реквизиты.МестоПрименения.Синоним,
				СтрокаТаблицы.НомерСтроки,
				Метаданные.Документы.АктПримененияСАТУРН.ТабличныеЧасти.МестаПрименения.Синоним);
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					Метаданные.Документы.АктПримененияСАТУРН.ТабличныеЧасти.МестаПрименения.Имя,
					СтрокаТаблицы.НомерСтроки, Метаданные.Документы.АктПримененияСАТУРН.ТабличныеЧасти.МестаПрименения.Реквизиты.МестоПрименения.Имя),,
					Отказ);
		
		ИначеЕсли Не СтрокаТаблицы.ТипМестаПрименения = Перечисления.ТипыМестПримененияСАТУРН.ЗарегистрованноеМестоПрименения
			И ЗначениеЗаполнено(СтрокаТаблицы.ТипМестаПрименения)
			И Не ЗначениеЗаполнено(СтрокаТаблицы.ОписаниеМестаПрименения) Тогда
			
			ТекстСообщения = СтрШаблон(
				ШаблонСообщения,
				Метаданные.Документы.АктПримененияСАТУРН.ТабличныеЧасти.МестаПрименения.Реквизиты.ОписаниеМестаПрименения.Синоним,
				СтрокаТаблицы.НомерСтроки,
				Метаданные.Документы.АктПримененияСАТУРН.ТабличныеЧасти.МестаПрименения.Синоним);
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					Метаданные.Документы.АктПримененияСАТУРН.ТабличныеЧасти.МестаПрименения.Имя,
					СтрокаТаблицы.НомерСтроки, Метаданные.Документы.АктПримененияСАТУРН.ТабличныеЧасти.МестаПрименения.Реквизиты.ОписаниеМестаПрименения.Имя),,
					Отказ);
					
		КонецЕсли;
		
	КонецЦикла;
	
	Если МестаПрименения.Количество() Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.МестоПрименения");
	Иначе
		ЕстьМестаПримененияВТоварах = Ложь;
		Для Каждого СтрокаТаблицы Из Товары Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.МестоПрименения) Тогда
				ЕстьМестаПримененияВТоварах = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьМестаПримененияВТоварах Тогда
			МассивНепроверяемыхРеквизитов.Добавить("МестаПрименения");
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("Товары.МестоПрименения");
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПоПриказу420 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ВнесеноНаПлощадь");
	КонецЕсли;
	
	ИнтеграцияСАТУРНПереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ИнтеграцияСАТУРН.ЗаписатьСоответствиеНоменклатуры(ЭтотОбъект);
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ИнтеграцияСАТУРН.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Для Каждого СтрокаТаблицы Из Товары Цикл
		СтрокаТаблицы.Партия = Неопределено;
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из МестаПрименения Цикл
		СтрокаТаблицы.ТипМестаПрименения      = Неопределено;
		СтрокаТаблицы.ОписаниеМестаПрименения = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ИнтеграцияИС.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.АктПримененияСАТУРН.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ИнтеграцияИС.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыНакопления.ОстаткиПартийСАТУРН.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияИСПереопределяемый.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);
	
	ИнтеграцияИС.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ИнтеграцияИСПереопределяемый.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	ИнтеграцияИС.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеСАТУРН.ДанныеЗаполненияАктПримененияСАТУРН(ОрганизацияСАТУРН);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеСАТУРН.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоПлануПримененияСАТУРН(ДанныеЗаполнения)
	
	ДанныеШапки = ВыборкаДанныхШапкиПланПрименения(ДанныеЗаполнения);
	
	Если ДанныеШапки.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеШапки);
		
	КонецЕсли;
	
	ДанныеЗаполненияТЧ = ВыборкаДанныхМестПрименения(ДанныеЗаполнения);
	
	ЗаполнитьДанныеМестПрименения(ДанныеЗаполненияТЧ.МестаПрименения, ДанныеЗаполненияТЧ.Препараты);
	
	ИнтеграцияСАТУРНКлиентСервер.ЗаполнитьТипИзмеряемойВеличиныИКоличествоВУпаковке(Товары);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеМестПрименения(ВыборкаПлановПрименения, ВыборкаПрепаратов)
	
	МестаПрименения.Очистить();
	Товары.Очистить();
	
	Пока ВыборкаПлановПрименения.Следующий() Цикл
		
		СтрокаТЧ = МестаПрименения.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаПлановПрименения);
		
	КонецЦикла;
	
	Пока ВыборкаПрепаратов.Следующий() Цикл
		
		СтрокаТЧ = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаПрепаратов);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыборкаДанныхШапкиПланПрименения(МассивПлановПрименения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивПлановПрименения);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПланПримененияСАТУРН.ОрганизацияСАТУРН      КАК ОрганизацияСАТУРН,
	|	ПланПримененияСАТУРН.ПлановаяДатаПрименения КАК ДатаПрименения,
	|	ПланПримененияСАТУРН.Комментарий            КАК Комментарий,
	|	ПланПримененияСАТУРН.СпособПримененияПАТ    КАК СпособПримененияПАТ,
	|	ПланПримененияСАТУРН.Ссылка                 КАК ДокументОснование
	|ИЗ
	|	Документ.ПланПримененияСАТУРН КАК ПланПримененияСАТУРН
	|ГДЕ
	|	ПланПримененияСАТУРН.Ссылка В (&Ссылка)";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ВыборкаДанныхМестПрименения(МассивПлановПрименения)
	
	РезультатВозврата = Новый Структура("МестаПрименения, Препараты");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивПлановПрименения);
	
	СписокЗапросов = Новый СписокЗначений;
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	МестаПрименения.МестоПрименения КАК МестоПрименения
	|ИЗ
	|	Документ.ПланПримененияСАТУРН.МестаПрименения КАК МестаПрименения
	|ГДЕ
	|	МестаПрименения.Ссылка В (&Ссылка)",
	"МестаПрименения");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	Товары.Номенклатура             КАК Номенклатура,
	|	Товары.Характеристика           КАК Характеристика,
	|	Товары.Серия                    КАК Серия,
	|	Товары.ПАТ                      КАК ПАТ,
	|	Товары.Дозировка                КАК Дозировка,
	|	Товары.Количество               КАК Количество,
	|	Товары.КоличествоУпаковок       КАК КоличествоУпаковок,
	|	Товары.Упаковка                 КАК Упаковка
	|ИЗ
	|	Документ.ПланПримененияСАТУРН.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В (&Ссылка)",
	"Препараты");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивПлановПрименения);
	
	РезультатЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	
	//@skip-warning
	ВыборкаМестаПрименения  = РезультатЗапроса["МестаПрименения"].Выбрать();
	//@skip-warning
	ВыборкаПрепараты = РезультатЗапроса["Препараты"].Выбрать();
	
	РезультатВозврата.МестаПрименения = ВыборкаМестаПрименения;
	РезультатВозврата.Препараты       = ВыборкаПрепараты;
	
	Возврат РезультатВозврата;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
